#1) Создать переменную типа String
a = "Tasha"
# 2) Создать переменную типа Integer
b = 15
# 3) Создать переменную типа Float
c = 2.5
# 4) Создать переменную типа Bytes
d = b'123/hello'
# 5) Создать переменную типа List
e = [1, "17", True]
# 6) Создать переменную типа Tuple
f = (1, 2, 3, 4, 5)
# 7) Создать переменную типа Set
g = {11, 12, 13}
# 8. Создать переменную типа Frozen set
h = frozenset({1, 2, 3})
# 9) Создать переменную типа Dict
i = {"name" : "Tasha", "age" : 30}
# 10) Вывести в консоль все выше перечисленные переменные с добавлением типа данных.
print("a =", a, type(a))
print("b =", b, type(b))
print("c =", c, type(c))
print("d =", d, type(d))
print("e =", e, type(e))
print("f =", f, type(f))
print("g =", g, type(g))
print("h =", h, type(h))
print("i =", i, type(i))
# 11) Создать 2 переменные String, создать переменную в которой сканкатенируете эти переменные. Вывести в консоль.
str1 = "Добрый "
str2 = "день!"
str3 = str1 + str2
print(str3)
# 12) Вывести в одну строку переменные типа String и Integer используя “,” (Запятую)
print (a, b)
# 13) Вывести в одну строку переменные типа String и Integer используя “+” (Плюс)
print (a + str(b))
